<<<<<<< HEAD
# СКЛАД

"""
объекты: 
    работники склада
    продукты
    полки

свойства:
    работники склада - подвижный объект, могут менять
    расположение продуктов, приносить и уносить их
    
    продукты - неподвижный объект
    
    полки - неподвижный объект, хранят продукты
=======
# СКЛАД

"""
объекты: 
    работники склада
    продукты
    полки

свойства:
    работники склада - подвижный объект, могут менять
    расположение продуктов, приносить и уносить их
    
    продукты - неподвижный объект
    
    полки - неподвижный объект, хранят продукты
>>>>>>> origin/master
"""